---
kind: property
id: P:Autodesk.Revit.DB.IPrintSetting.PrintParameters
source: html/66605827-b48a-ccc7-b2ad-8397b8810ac6.htm
---
# Autodesk.Revit.DB.IPrintSetting.PrintParameters Property

Returns the Parameters of Print Setup.

## Syntax (C#)
```csharp
PrintParameters PrintParameters { get; }
```

## Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.